#===========================================================================#
#                    Профиль netstyle-minimal                               #
#===========================================================================#
# (C) Denis Smirnov <mithraen@freesource.info>                     May 2011 #
#===========================================================================#
CONFIGDIR = /usr/share/mkimage
include $(CONFIGDIR)/config.mk

# во что сжимать (xz/gzip/bzip2)
# внимание! xz поддерживается только в относительно новом mkimage
MKI_CPIO_COMPRESS = xz

# в какой формат паковать чрут и под каким именем
# до двоеточия -- формат, после -- имя
# внимание! формат сжатия -- строчкой выше, и если здесь
# написать расширение хоть txt -- формат как архива, так и алгоритм
# сжатия от этого ничуть не изменится
MKI_PACK_RESULTS = cpio:netstyle-server-light.cpio.xz

# перечисление package-lists
# я здесь использую wildcard, потому как мы следуем логике "один профиль --
# один git repo или хотя бы бранч".  используется расширение lst, для того
# чтобы автоматически игнорировать *.bak, и прочий мусор, а также была
# возможность в процессе отладки легко добавить/убрать группу пакетов просто
# переименованием
IMAGE_PACKAGES = ${wildcard packages.d/*.lst}

include $(CONFIGDIR)/targets.mk

# build-image -- устанавливает пакеты в чрут
# run-image-scrips -- запускает в чруте скрипты
# pack-image -- упаковывает
# результат будет лежать в .work/.out/netstyle-minimal.cpio
all: build-image run-image-scripts pack-image

